n = int(input("Input number: "))

if n < 0 :
    n = 0
    print("n changed to zero")
#elif n == 0:
#    print("zero")

if n == 0:
    print("Zero")


# Условие
# Даны три целых числа. Определите, сколько среди них совпадающих.
# Программа должна вывести одно из чисел: 3 (если все совпадают), 2 (если два совпадает) или 0 (если все числа различны).
# a,b,c=int(input()),int(input()),int(input())
#
# a, b, c = [int (input ()) for i in range (3)]
# if a==b==c:
#     print (3)
# elif a==b or b==c or a==c:
#     print (2)
# else:
#     print (0)


